
/* 文档包含对字符操作的函数接口 */
/* 如string字符大小写字符转换、字符翻转等 */


#include "eiot_char.h"
/*
*********************************************************************************************************
*	函 数 名: swap
*	功能说明: 交换一字节数据
*	形    参: a,b
*	返 回 值: 无
*********************************************************************************************************
*/
void swap(char *a, char *b) {
    char t = *a;
    *a = *b, *b = t;
}

/*
*********************************************************************************************************
*	函 数 名: reverseString
*	功能说明: 反转数据头尾，对象：字符串/数组
*	形    参: 数据地址,数据大小
*	返 回 值: 无
*********************************************************************************************************
*/
void reverseString(char *s, int sSize) {
    for (int left = 0, right = sSize - 1; left < right; ++left, --right) {
        swap(s + left, s + right);
    }
}





